tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "shivammathur/php"
brew "little-cms2"
brew "boost"
brew "python@3.10"
brew "asciidoc"
brew "autoconf"
brew "automake"
brew "glib"
brew "python@3.9"
brew "cairo"
brew "libssh2"
brew "cargo-c"
brew "unbound"
brew "gnutls"
brew "cask"
brew "cmake"
brew "curl"
brew "freetds"
brew "libavif"
brew "gd"
brew "php"
brew "composer"
brew "harfbuzz"
brew "libarchive"
brew "libass"
brew "libbluray"
brew "tesseract"
brew "ffmpeg"
brew "gcc"
brew "git-lfs"
brew "gobject-introspection"
brew "guile"
brew "node"
brew "http-server"
brew "libgit2"
brew "lua"
brew "mas"
brew "ninja"
brew "meson"
brew "mkcert"
brew "nghttp2"
brew "nodebrew"
brew "nss"
brew "php@7.4"
brew "pyenv"
brew "python@3.8", link: false
brew "rust"
brew "sphinx-doc"
brew "uncrustify"
brew "vim"
brew "xcodes"
cask "anydesk"
cask "appcleaner"
cask "deepl"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "hammerspoon"
cask "input-source-pro"
cask "insomnia"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "kindle"
cask "messenger"
cask "microsoft-edge"
cask "monitorcontrol"
cask "notion"
cask "openframeworks"
cask "processing"
cask "slack"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "yousician"
cask "zoom"
mas "ApowerMirror", id: 1244625890
mas "ApowerREC", id: 1336928544
mas "FreeChat for Facebook Messenger", id: 1077753332
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Speed-Up", id: 412356892
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
vscode "8amjp.charactercount"
vscode "acidic9.p5js-snippets"
vscode "albymor.increment-selection"
vscode "analytic-signal.preview-pdf"
vscode "anseki.vscode-color"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "brapifra.phpserver"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "circledev.glsl-canvas"
vscode "cschlosser.doxdocgen"
vscode "dalexhd.42-norminette"
vscode "DEVSENSE.composer-php-vscode"
vscode "DEVSENSE.phptools-vscode"
vscode "DEVSENSE.profiler-php-vscode"
vscode "donjayamanne.githistory"
vscode "ecmel.vscode-html-css"
vscode "eg2.vscode-npm-script"
vscode "esbenp.prettier-vscode"
vscode "evilcat.norminette-42"
vscode "filipesabella.live-p5"
vscode "FleeXo.cpp-class-creator"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "GitHub.vscode-pull-request-github"
vscode "HookyQR.beautify"
vscode "HookyQR.minify"
vscode "ionutvmi.path-autocomplete"
vscode "j-zeppenfeld.tab-indent-space-align"
vscode "jeff-hykin.better-cpp-syntax"
vscode "junstyle.php-cs-fixer"
vscode "keyhr.42-c-format"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "kube.42header"
vscode "lihui.vs-color-picker"
vscode "Luke-zhang-04.processing-vscode"
vscode "MariusvanWijk-JoppeKoers.codam-norminette-3"
vscode "masakit.zenkaku-hankaku"
vscode "mattn.Runner"
vscode "millennIumAMbiguity.processing-formatter"
vscode "mkaufman.HTMLHint"
vscode "mosapride.zenkaku"
vscode "mrmlnc.vscode-autoprefixer"
vscode "mrmlnc.vscode-csscomb"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-audio"
vscode "msjsdiag.debugger-for-chrome"
vscode "olback.es6-css-minify"
vscode "pranaygp.vscode-css-peek"
vscode "raczzalan.webgl-glsl-editor"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shinhwagk.mkstring"
vscode "slevesque.shader"
vscode "sohamkamani.code-eol"
vscode "stevensona.shader-toy"
vscode "tal7aouy.indent-colorizer"
vscode "Tobiah.language-pde"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vincaslt.highlight-matching-tag"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "Vue.volar"
vscode "Wscats.eno"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yzhang.markdown-all-in-one"
vscode "Zignd.html-css-class-completion"
vscode "zobo.php-intellisense"
